generated/postgres-direct-tls.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-06-10 Tue 14:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>How direct TLS can speed up your connections</title>
<meta name="author" content="Marc Bowes" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="assets/bigblow/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="assets/bigblow/css/bigblow.css"/>
<link rel="stylesheet" type="text/css" href="assets/bigblow/css/hideshow.css"/>
<link rel="stylesheet" type="text/css" href="assets/bigblow/css/responsive.css"/>
<meta name="viewport" content="width=device-width, initial-scale=1.0" />
</head>
<body>
<div id="content" class="h-full antialiased light">
<div id="outline-container-org46e4029" class="outline-2">
<h2 id="org46e4029">How direct TLS can speed up your connections</h2>
<div class="outline-text-2" id="text-org46e4029">
<p>
A few months ago, one of my Aurora DSQL teammates reported a curious finding.
When connecting to their DSQL clusters using the corporate VPN, their
connections were fast and snappy - as they should be! But, when connecting
<i>without using the VPN</i>, their connections were taking around 3 seconds.
Curiously, this was only happening when in the AWS offices.
</p>
</div>
<div id="outline-container-orga7bb435" class="outline-3">
<h3 id="orga7bb435">Discovery</h3>
<div class="outline-text-3" id="text-orga7bb435">
<p>
The trigger for this discovery was the public Preview of Aurora DSQL at
re:Invent 2024. Before the public release, access to DSQL had been restricted,
requiring developers to be on the corporate VPN. Developers started to interact
with DSQL off-VPN, and realized it was slower - way slower - than before.
</p>

<p>
What could possibly explain this? Clearly, it&rsquo;s &ldquo;the network&rdquo; since that&rsquo;s the
only difference. That doesn&rsquo;t mean the office WiFi is slow - otherwise
connections would always be slow, instead of just off-VPN connections. But
<i>something</i> about the office WiFi was adding significant overhead.
</p>

<p>
As it turns out, the office has three networks:
</p>

<ol class="org-ol">
<li>Both a WiFi and wired network for Amazon employees</li>
<li>A WiFi network for guests</li>
</ol>

<p>
One of my teammates did the following tests:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Network type</th>
<th scope="col" class="org-left">slow</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Employee WiFi</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">Employee wired</td>
<td class="org-left">yes</td>
</tr>

<tr>
<td class="org-left">Guest WiFi</td>
<td class="org-left">no</td>
</tr>
</tbody>
</table>

<p>
So&#x2026; there&rsquo;s something specific happening <i>only on the corporate network</i>.
</p>

<p>
After doing some server-side debugging, the team noticed something strange. For
every connection being opened to the cluster, an additional connection was being
made. This second connection wasn&rsquo;t even speaking Postgres!
</p>
</div>
</div>
<div id="outline-container-org0e721d2" class="outline-3">
<h3 id="org0e721d2">How PostgreSQL does TLS</h3>
<div class="outline-text-3" id="text-org0e721d2">
<p>
<i>Reference: <a href="https://www.postgresql.org/docs/16/protocol-flow.html">Message Flow</a> from the Postgres 16 documentation.</i>
</p>

<p>
To quote (with slight edits):
</p>

<blockquote>
<p>
To initiate an SSL-encrypted connection, the frontend [Postgres client]
initially sends an SSLRequest message rather than a StartupMessage.
</p>

<p>
The server then responds with a single byte containing S or N, indicating that
it is willing or unwilling to perform SSL, respectively. The frontend might
close the connection at this point if it is dissatisfied with the response. To
continue after S, perform an SSL startup handshake (not described here, part of
the SSL specification) with the server. If this is successful, continue with
[&#x2026;]
</p>
</blockquote>

<p>
To anthropomorphize this:
</p>

<ol class="org-ol">
<li>client → server: <i>Hey, I&rsquo;d like to talk to you, but first let&rsquo;s setup TLS</i></li>
<li>server → client: <i>Sure, go ahead</i></li>
<li>client ⇵ server: <b>TLS handshake</b></li>
<li>client ⇵ server: [encrypted stream continues]</li>
</ol>

<p>
So, what we&rsquo;re seeing in our logs is that the <i>first</i> connection does this, but
the <i>second</i> connection isn&rsquo;t. The second connection was skipping ahead to step
3 and initiating a TLS handshake. Where is this second connection coming from,
and why isn&rsquo;t it following protocol?
</p>
</div>
</div>
<div id="outline-container-orgc5624aa" class="outline-3">
<h3 id="orgc5624aa">Cisco TLS Server Identity Discovery</h3>
<div class="outline-text-3" id="text-orgc5624aa">
<p>
After engaging with our corporate networking team, they shared the following
resource with us:
</p>

<p>
<a href="https://www.ciscolive.com/c/dam/r/ciscolive/us/docs/2021/pdf/BRKSEC-2106.pdf">https://www.ciscolive.com/c/dam/r/ciscolive/us/docs/2021/pdf/BRKSEC-2106.pdf</a>
</p>

<p>
This is awesome documentation, so if you&rsquo;re into details, I&rsquo;d recommend going
through it. Otherwise, here&rsquo;s the summary.
</p>

<p>
The Cisco firewall has the capability to add rules based on the URL or
application being accessed. When you initiate a TLS connection, the client sends
a &ldquo;hello&rdquo; message to the server, and the server responds with some information
including its certificate. The firewall uses information present in the server&rsquo;s
TLS certificate to enforce rules.
</p>

<p>
To really spell that out: the firewall sees the packets you&rsquo;re sending and
receiving. When the client sends a <i>hello</i>, the firewall says &ldquo;that looks like a
TLS hello&rdquo;, and then waits for the server&rsquo;s response. It inspects the
certificate and then applies any rules.
</p>

<p>
In TLS 1.3, the server&rsquo;s certificate is encrypted, which means the firewall
can&rsquo;t do this anymore. That&rsquo;s what this slide deck is about. <i>TLS Server
Identity Discovery</i> is a feature that works around this problem. The firewall
will open a <i>second connection</i> and do a TLS 1.2 handshake to retrieve the
certificate in plaintext. If the rules allow the connection, the firewall then
allow the connection to proceed.
</p>

<p>
But, of course, that&rsquo;s not what Postgres is expecting. Postgres is expecting
that clients who want to do TLS should first ask if the server supports it.
</p>

<p>
As it turns out, our firewall wasn&rsquo;t configured to block unknown applications.
What was happening is the firewall <i>tried</i> to learn the certificate, then gave
up after 3s, allowing the original connection through. Mystery solved!
</p>
</div>
</div>
<div id="outline-container-org6ffefd4" class="outline-3">
<h3 id="org6ffefd4">Direct TLS support</h3>
<div class="outline-text-3" id="text-org6ffefd4">
<p>
Here are those same Postgres docs again, this time on <a href="https://www.postgresql.org/docs/17/protocol-flow.html#PROTOCOL-FLOW-SSL">version 17</a>. There&rsquo;s new
content!
</p>

<blockquote>
<p>
A second alternate way to initiate SSL encryption is available. The server will
recognize connections which immediately begin SSL negotiation without any
previous SSLRequest packets. Once the SSL connection is established the server
will expect a normal startup-request packet and continue negotiation over the
encrypted channel.
</p>
</blockquote>

<p>
What this is saying is that if you&rsquo;re using Postgres 17+ on both the server and
client, you can skip steps 1 and 2 from earlier. You can just start with a TLS
handshake.
</p>

<p>
To turn this feature on in the client, you need three things:
</p>

<ol class="org-ol">
<li>A Postgres 17+ client</li>
<li><code>sslmode=require</code>, set as a connection parameter, or via <code>$PGSSLMODE</code></li>
<li><code>sslnegotiation=direct</code>, set as a connection parameter</li>
</ol>

<p>
We added this feature to Aurora DSQL, and <i>boom</i>, problem solved. No more 3
second stalls. By making the server support <i>direct TLS</i>, that second connection
opened by the firewall would succeed.
</p>

<p>
The Postgres docs go on to say:
</p>

<blockquote>
<p>
In this case any other requests for encryption will be refused. This method is
not preferred for general purpose tools as it cannot negotiate the best
connection encryption available or handle unencrypted connections. However it is
useful for environments where both the server and client are controlled
together. In that case it avoids one round trip of latency and allows the use of
network tools that depend on standard SSL connections. When using SSL
connections in this style the client is required to use the ALPN extension
defined by RFC 7301 to protect against protocol confusion attacks. The
PostgreSQL protocol is &ldquo;postgresql&rdquo; as registered at IANA TLS ALPN Protocol IDs
registry.
</p>
</blockquote>

<p>
Saving a round trip is cool! Who doesn&rsquo;t like faster connections?
</p>

<p>
Aurora DSQL, like most AWS services, is TLS-only. If you connect to DSQL without
requesting TLS, you&rsquo;ll get rejected:
</p>

<div class="org-src-container">
<pre class="src src-sh">psql <span style="color: #98be65;">"host=beabuc4gtix7m2hr6xh2huewkm.dsql.us-west-2.on.aws sslmode=disable"</span>
FATAL:  unable to accept connection, SSL is mandatory. AWS Authentication is required.
</pre>
</div>

<p>
Therefore, we <b>do recommend</b> using the direct TLS feature. There is no downside
to using direct TLS; it is strictly better if your client supports it. I&rsquo;m
pleasantly surprised by how quickly this feature got added to the ecosystem of
clients and drivers.
</p>

<p>
Thank you to everybody who contributed this feature to Postgres. If you want
to learn more about its development, checkout these threads:
</p>

<ul class="org-ul">
<li><a href="https://www.postgresql.org/message-id/flat/CAM-w4HOEAzxyY01ZKOj-iq%3DM4-VDk%3DvzQgUsuqiTFjFDZaebdg%40mail.gmail.com">Experiments with Postgres and SSL</a></li>
<li><a href="https://www.postgresql.org/message-id/flat/ZiH7vHwEJeRKHlST%40paquier.xyz">Direct SSL connection with ALPN and HBA rules</a></li>
</ul>
</div>
</div>
<div id="outline-container-org30fce4d" class="outline-3">
<h3 id="org30fce4d">Using direct TLS with Aurora DSQL</h3>
<div class="outline-text-3" id="text-org30fce4d">
<p>
Here is a full example of connecting to a cluster using psql and direct TLS:
</p>

<div class="org-src-container">
<pre class="src src-sh"><span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">ENDPOINT</span>=beabuc4gtix7m2hr6xh2huewkm.dsql.us-west-2.on.aws
<span style="color: #c678dd;">export</span> <span style="color: #dcaeea;">PGPASSWORD</span>=$<span style="color: #51afef;">(</span>aws dsql generate-db-connect-admin-auth-token --hostname $<span style="color: #dcaeea;">ENDPOINT</span><span style="color: #51afef;">)</span>
psql <span style="color: #98be65;">"host=</span><span style="color: #a9a1e1;">$</span><span style="color: #dcaeea;">ENDPOINT</span><span style="color: #98be65;"> user=admin dbname=postgres sslmode=require sslnegotiation=direct"</span>
<span style="color: #c678dd;">psql</span> <span style="color: #51afef;">(</span><span style="color: #da8548; font-weight: bold;">17.4</span> <span style="color: #c678dd;">(</span>Homebrew<span style="color: #c678dd;">)</span>, server <span style="color: #da8548; font-weight: bold;">16.9</span><span style="color: #51afef;">)</span>
SSL connection <span style="color: #51afef;">(</span>protocol: TLSv1.3, cipher: TLS_AES_128_GCM_SHA256, compression: off, ALPN: postgresql<span style="color: #51afef;">)</span>
</pre>
</div>

<p>
You can also use <code>pdsql</code> <a href="https://github.com/marcbowes/postgres/blob/master/README_DSQL.md">(link)</a>, like so:
</p>

<div class="org-src-container">
<pre class="src src-sh">pdsql <span style="color: #98be65;">"host=beabuc4gtix7m2hr6xh2huewkm.dsql.us-west-2.on.aws user=admin dbname=postgres"</span>
</pre>
</div>

<p>
In addition to automating token generation, <code>pdsql</code> will automatically add
<code>"sslmode=require sslnegotiation=direct"</code>. If you don&rsquo;t want to download another
tool, you can build a bash function that does something similar.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
